Autodesk.Revit.DB.Visual.Metal.CommonTintColor
The property labeled "Tint Color" from the "Metal" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
Since:
2018.1

Autodesk.Revit.DB.Visual.Metal.CommonTintToggle
The property labeled "Tint" from the "Metal" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Metal.MetalPerforationsCenter
The property labeled "Center Spacing" from the "Metal" schema.
Remarks:
This property is of type "AssetPropertyDouble" with a minimum of "0.0001".
Since:
2018.1

Autodesk.Revit.DB.Visual.Metal.MetalPerforationsSize
The property labeled "Diameter/Size" from the "Metal" schema.
Remarks:
This property is of type "AssetPropertyDouble" with a minimum of "0.0001".
Since:
2018.1

Autodesk.Revit.DB.Visual.Metal.MetalPerforationsShader
The property labeled "Image" from the "Metal" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.Metal.MetalPerforations
The property labeled "Cutouts" from the "Metal" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalPerforationsType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Metal.MetalPatternScale
The property labeled "Scale" from the "Metal" schema.
Remarks:
This property is of type "AssetPropertyDouble" with a minimum of "0".
Since:
2018.1

Autodesk.Revit.DB.Visual.Metal.MetalPatternHeight
The property labeled "Amount" from the "Metal" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 2".
Since:
2018.1

Autodesk.Revit.DB.Visual.Metal.MetalPatternShader
The property labeled "Image" from the "Metal" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.Metal.MetalPattern
The property labeled "Relief Pattern" from the "Metal" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalPatternType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Metal.MetalFinish
The property labeled "Finish" from the "Metal" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalFinishType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Metal.MetalPatina
The property labeled "Patina" from the "Metal" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.Metal.MetalColor
The property labeled "Color" from the "Metal" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Metal.MetalType
The property labeled "Type" from the "Metal" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Metal
Represents the properties of materials.
Since:
2018.1